BAS BMEKZU Project/src/Documents/ИНАГРО_КорректировкаИспользованияРаботникамиРабочегоВремени/ИНАГРО_КорректировкаИспользованияРаботникамиРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИНАГРО_КорректировкаИспользованияРаботникамиРабочегоВремени</name>
  <registerRecords>AccumulationRegister.ИНАГРО_РабочееВремяРаботниковОрганизаций</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>РазвернутыйПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтработанноеВремя</name>
    <attributes>
      <name>ВидИспользованияРабочегоВремени</name>
      <type>
        <types>CatalogRef.ИНАГРО_КлассификаторИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоДнейПоНорме</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоЧасовПоНорме</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <comment>Сотрудник, внутреннее совместительство, Сотрудник которого заменяют</comment>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаботникиОрганизации</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BAS BMEKZU Project/src/Enums/ИНАГРО_ВидыВремени/ИНАГРО_ВидыВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИНАГРО_ВидыВремени</name>
  <enumValues>
    <name>ОтработанноеВПределахНормы</name>
    <comment>Начисление за работу полную рабочую смену в пределах нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ОтработанноеСверхНормы</name>
    <comment>Начисление за работу сверх нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ЦелодневноеНеотработанное</name>
  </enumValues>
  <enumValues>
    <name>ЧасовоеНеотработанное</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноОплачиваемоеВПределахНормы</name>
    <comment>Дополнительное начисление в пределах нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ЧасовоеОтработанноеВПределахНормы</name>
    <comment>Начисление за работу неполную смену в пределах нормы времени</comment>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Documents/ИНАГРО_КорректировкаИспользованияРаботникамиРабочегоВремени/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыИФункцииПечати

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Корректировка использования рабочего времени
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Бланк";
	КомандаПечати.Представление = НСтр("ru='Печать документа';uk='Друк документа'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаДокумента,ФормаСписка";
	
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Реестр";
	КомандаПечати.Представление = НСтр("ru='Реестр документов';uk='Реєстр документів'");
	КомандаПечати.ЗаголовокФормы= НСтр("ru='Реестр документов ""Корректировка использования работниками рабочего времени ""';uk='Реєстр документів ""Коригування використання робітниками робочого часу""'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм    = "ФормаСписка";
	КомандаПечати.Порядок       = 100;

КонецПроцедуры

// Выводит на печать подготовленный макет
//
// Параметры:
//	ИмяМакета
//	КоличествоЭкземпляров
//	НаПринтер
//	НепосредственнаяПечать
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Устанавливаем признак доступности печати покомплектно.
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	// Проверяем, нужно ли для макета СчетЗаказа формировать табличный документ.
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Бланк") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Бланк", НСтр("ru='Печать документа';uk='Друк документа'"), 
		ПечатьДокумента(МассивОбъектов, ОбъектыПечати, ПараметрыВывода), , "Документ.ИНАГРО_КорректировкаИспользованияРаботникамиРабочегоВремени.ПФ_MXL_Макет", ,Истина);
	КонецЕсли;  		                                                                                                                     
	
КонецПроцедуры

// Функция формирует печатную форму документа
Функция ПечатьДокумента(МассивОбъектов,ОбъектыПечати, ПараметрыВывода) 
	
	УстановитьПривилегированныйРежим(Истина);
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИНАГРО_КорректировкаИспользованияРаботникамиРабочегоВремени.ПФ_MXL_Макет");
	ПервыйДокумент = Истина;
	ТабДокумент = Новый ТабличныйДокумент;
	Для каждого Ссылка Из МассивОбъектов Цикл
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиВертикальныйРазделительСтраниц();
		КонецЕсли; 
		ПервыйДокумент = Ложь;
		
		// формируем табличную часть документа
		Запрос = Новый Запрос;
		// Установим параметры запроса
		Запрос.УстановитьПараметр("ДокументСсылка",					Ссылка);
		Запрос.УстановитьПараметр("ПустаяДата",						Дата('00010101'));
		Запрос.УстановитьПараметр("СписокНедопустимыхВидовВремени",	ПолучитьСписокНедопустимыхВидовВремени());
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СтрокиТЧ.Сотрудник,
		|	СтрокиТЧ.Назначение,
		|	СтрокиТЧ.ВидИспользованияРабочегоВремени КАК ВидИспользованияРабочегоВремени,
		|	СтрокиТЧ.ВидИспользованияРабочегоВремени.ВидВремени КАК ВидВремени,
		|	ВЫБОР
		|		КОГДА СтрокиТЧ.ВидИспользованияРабочегоВремени.ВидВремени В (&СписокНедопустимыхВидовВремени)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НедопустимыйВидВремени,
		|	СтрокиТЧ.ДатаНачала КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА СтрокиТЧ.ДатаОкончания <> &ПустаяДата
		|			ТОГДА НАЧАЛОПЕРИОДА(СтрокиТЧ.ДатаОкончания, ДЕНЬ)
		|		ИНАЧЕ &ПустаяДата
		|	КОНЕЦ КАК ДатаОкончания,
		|	СтрокиТЧ.НомерСтроки КАК НомерСтроки,
		|	СтрокиТЧ.ВсегоДней КАК ВсегоДней,
		|	СтрокиТЧ.ВсегоЧасов КАК ВсегоЧасов,
		|	СтрокиТЧ.Сотрудник.Код КАК ТабНом
		|ИЗ
		|	Документ.ИНАГРО_КорректировкаИспользованияРаботникамиРабочегоВремени.ОтработанноеВремя КАК СтрокиТЧ
		|ГДЕ
		|	СтрокиТЧ.Ссылка = &ДокументСсылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		ОтработанноеВремя = Запрос.Выполнить();
	
	// Получаем данные для печати
	ТаблицаДок = ОтработанноеВремя.Выгрузить();
	Макет = ПолучитьМакет("ПФ_MXL_Макет");
	
	// Печать производится на языке, указанном в настройках пользователя
	КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;                                                                                                                      
	СведенияОбОрганизации =БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Ссылка.Организация, Ссылка.Дата,,,КодЯзыкаПечать);
	ОблЗаголовок = Макет.ПолучитьОбласть("ОблЗаголовок");
	ОблЗаголовок.Параметры.Организация = Ссылка.Организация.НаименованиеПолное;                                                                                                           
	ОблЗаголовок.Параметры.ТекДата = ТекущаяДата();
	ОблЗаголовок.Параметры.ПодразделениеОрганизации = Ссылка.ПодразделениеОрганизации;
	ОблЗаголовок.Параметры.ПериодСтр = Формат(Ссылка.ПериодРегистрации,"Л="+ КодЯзыкаПечать +"_UA; ДФ='ММММ гггг'")+НСтр("ru=' г.';uk=' р.'",КодЯзыкаПечать);
	ТабДокумент.Вывести(ОблЗаголовок);
	
	Область = Макет.ПолучитьОбласть("Шапка");
	ТабДокумент.Вывести(Область);
	Область = Макет.ПолучитьОбласть("Детали"); 
	Ном = 0;
	
	// Начинаем формировать выходной документ
	Для каждого Строка_ Из ТаблицаДок Цикл
		Ном = Ном+1;
		Область.Параметры.Заполнить(Строка_);
		Область.Параметры.Номер = Ном;
		ТабДокумент.Вывести(Область);
	КонецЦикла;
	
	КонецЦикла; 
	Возврат ТабДокумент;
	
КонецФункции

// Возвращает список видов времени, которые нельзя вводить этим документом
//
// Параметры
//	Нет.
//
// Возвращаемое значение:
//	Список значений, содержащий подходящий перечень значений перечисления ВидыВремени.
//
Функция ПолучитьСписокНедопустимыхВидовВремени() 
	
	Список = Новый СписокЗначений;
	Список.Добавить(Перечисления.ИНАГРО_ВидыВремени.ОтработанноеСверхНормы);
	Список.Добавить(Перечисления.ИНАГРО_ВидыВремени.ЧасовоеНеотработанное);
	
	Возврат Список;
	
КонецФункции

Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура;	
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 

#КонецЕсли
